tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_DMA4.h
    kDma4RequestMuxQTIMER8Cmpld1Timer3Cmpld2Timer2 = 153|0x200U, /**< TMR8 cmpld1 in timer 3 or cmpld2 in timer 2 */
    kDma4RequestMuxLPI2C6Tx         = 165|0x200U,  /**< LPI2C6 TX */
    kDma4RequestMuxLPI2C6Rx         = 166|0x200U,  /**< LPI2C6 RX */
    kDma4RequestMuxLPTMR3Request    = 171|0x200U,  /**< LPTMR3 */
    kDma4RequestMuxSai2Tx           = 180|0x200U,  /**< SAI2 TX */
    kDma4RequestMuxSai2Rx           = 181|0x200U,  /**< SAI2 RX */
    kDma4RequestMuxSai4Tx           = 184|0x200U,  /**< SAI4 TX */
    kDma4RequestMuxSai4Rx           = 185|0x200U,  /**< SAI4 RX */
    kDma4RequestMuxSINC1Request0    = 208|0x200U,  /**< SINC1 Request 0 */
    kDma4RequestMuxSINC1Request1    = 209|0x200U,  /**< SINC1 Request 1 */
    kDma4RequestMuxSINC1Request2    = 210|0x200U,  /**< SINC1 Request 2 */
    kDma4RequestMuxSINC1Request3    = 211|0x200U,  /**< SINC1 Request 3 */
    kDma4RequestMuxSINC2Request0    = 212|0x200U,  /**< SINC2 Request 0 */
    kDma4RequestMuxSINC2Request1    = 213|0x200U,  /**< SINC2 Request 1 */
    kDma4RequestMuxSINC2Request2    = 214|0x200U,  /**< SINC2 Request 2 */
    kDma4RequestMuxSINC2Request3    = 215|0x200U,  /**< SINC2 Request 3 */
    kDma3RequestMuxLPUART12Tx       = 31|0x100U,   /**< LPUART12 TX */
    kDma3RequestMuxLPUART12Rx       = 32|0x100U,   /**< LPUART12 RX */
    kDma4RequestMuxTPM5Request0Request2 = 31|0x200U, /**< TPM5 request 0 and request 2 */
    kDma4RequestMuxTPM5Request1Request3 = 32|0x200U, /**< TPM5 request 1 and request 3 */
    kDma4RequestMuxTPM5OverflowRequest = 33|0x200U, /**< TPM5 Overflow request */
    kDma4RequestMuxTPM6Request0Request2 = 34|0x200U, /**< TPM6 request 0 and request 2 */
    kDma4RequestMuxTPM6Request1Request3 = 35|0x200U, /**< TPM6 request 1 and request 3 */
    kDma4RequestMuxTPM6OverflowRequest = 36|0x200U, /**< TPM6 Overflow request */
    kDma4RequestMuxLPUART9Tx        = 172|0x200U,  /**< LPUART9 TX */
    kDma4RequestMuxLPUART9Rx        = 173|0x200U,  /**< LPUART9 RX */
    kDma4RequestMuxLPUART10Tx       = 174|0x200U,  /**< LPUART10 TX */
    kDma4RequestMuxLPUART10Rx       = 175|0x200U,  /**< LPUART10 RX */
    kDma4RequestMuxLPUART11Tx       = 176|0x200U,  /**< LPUART11 TX */
    kDma4RequestMuxLPUART11Rx       = 177|0x200U,  /**< LPUART11 RX */
    kDma4RequestMuxSai3Tx           = 182|0x200U,  /**< SAI3 TX */
    kDma4RequestMuxSai3Rx           = 183|0x200U,  /**< SAI3 RX */
    kDma4RequestMuxCMP1             = 187|0x200U,  /**< CMP1 */
    kDma4RequestMuxCMP2             = 188|0x200U,  /**< CMP2 */
    kDma4RequestMuxCMP4             = 190|0x200U,  /**< CMP4 */
} dma_request_source_t;

/* @} */
#endif /* DMA_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- DMA4 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA4_Peripheral_Access_Layer DMA4 Peripheral Access Layer
 * @{
 */

/** DMA4 - Size of Registers Arrays */
#define DMA4_MP_GRPRI_COUNT                       64u
#define DMA4_TCD_COUNT                            64u

/** DMA4 - Register Layout Typedef */
typedef struct {
  __IO uint32_t MP_CSR;                            /**< Management Page Control Register, offset: 0x0 */
  __I  uint32_t MP_ES;                             /**< Management Page Error Status Register, offset: 0x4 */
  __I  uint32_t MP_INT_LOW;                        /**< Management Page Interrupt Request Status Register - Low, offset: 0x8 */
  __I  uint32_t MP_INT_HIGH;                       /**< Management Page Interrupt Request Status Register- High, offset: 0xC */
  __I  uint32_t MP_HRS_LOW;                        /**< Management Page Hardware Request Status Register - Low, offset: 0x10 */
  __I  uint32_t MP_HRS_HIGH;                       /**< Management Page Hardware Request Status Register - High, offset: 0x14 */
       uint8_t RESERVED_0[232];
  __IO uint32_t CH_GRPRI[DMA4_MP_GRPRI_COUNT];     /**< Channel Arbitration Group Register, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_1[65024];
  struct {                                         /* offset: 0x10000, array step: 0x8000 */
    __IO uint32_t CH_CSR;                            /**< Channel Control and Status Register, array offset: 0x10000, array step: 0x8000 */
    __IO uint32_t CH_ES;                             /**< Channel Error Status Register, array offset: 0x10004, array step: 0x8000 */
    __IO uint32_t CH_INT;                            /**< Channel Interrupt Status Register, array offset: 0x10008, array step: 0x8000 */
    __IO uint32_t CH_SBR;                            /**< Channel System Bus Register, array offset: 0x1000C, array step: 0x8000 */
    __IO uint32_t CH_PRI;                            /**< Channel Priority Register, array offset: 0x10010, array step: 0x8000 */
    __IO uint32_t CH_MUX;                            /**< Channel Multiplexor Configuration, array offset: 0x10014, array step: 0x8000 */
    __IO uint16_t CH_MATTR;                          /**< Memory Attributes Register, array offset: 0x10018, array step: 0x8000 */
         uint8_t RESERVED_0[6];
    __IO uint32_t SADDR;                             /**< TCD Source Address Register, array offset: 0x10020, array step: 0x8000 */
    __IO uint16_t SOFF;                              /**< TCD Signed Source Address Offset Register, array offset: 0x10024, array step: 0x8000 */
    __IO uint16_t ATTR;                              /**< TCD Transfer Attributes Register, array offset: 0x10026, array step: 0x8000 */
    union {                                          /* offset: 0x10028, array step: 0x8000 */
      __IO uint32_t NBYTES_MLOFFNO;                    /**< TCD Transfer Size without Minor Loop Offsets Register, array offset: 0x10028, array step: 0x8000 */
      __IO uint32_t NBYTES_MLOFFYES;                   /**< TCD Transfer Size with Minor Loop Offsets Register, array offset: 0x10028, array step: 0x8000 */
    };
    __IO uint32_t SLAST_SDA;                         /**< TCD Last Source Address Adjustment / Store DADDR Address Register, array offset: 0x1002C, array step: 0x8000 */
    __IO uint32_t DADDR;                             /**< TCD Destination Address Register, array offset: 0x10030, array step: 0x8000 */
    __IO uint16_t DOFF;                              /**< TCD Signed Destination Address Offset Register, array offset: 0x10034, array step: 0x8000 */
    union {                                          /* offset: 0x10036, array step: 0x8000 */
      __IO uint16_t CITER_ELINKNO;                     /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) Register, array offset: 0x10036, array step: 0x8000 */
      __IO uint16_t CITER_ELINKYES;                    /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) Register, array offset: 0x10036, array step: 0x8000 */
    };
    __IO uint32_t DLAST_SGA;                         /**< TCD Last Destination Address Adjustment / Scatter Gather Address Register, array offset: 0x10038, array step: 0x8000 */
    __IO uint16_t CSR;                               /**< TCD Control and Status Register, array offset: 0x1003C, array step: 0x8000 */
    union {                                          /* offset: 0x1003E, array step: 0x8000 */
      __IO uint16_t BITER_ELINKNO;                     /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) Register, array offset: 0x1003E, array step: 0x8000 */
      __IO uint16_t BITER_ELINKYES;                    /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) Register, array offset: 0x1003E, array step: 0x8000 */
    };
         uint8_t RESERVED_1[32704];
  } TCD[DMA4_TCD_COUNT];
} DMA4_Type;

/* ----------------------------------------------------------------------------
   -- DMA4 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA4_Register_Masks DMA4 Register Masks
 * @{
 */

/*! @name MP_CSR - Management Page Control Register */
/*! @{ */

